{
  "blogs": [
    {
      "title": "First Blood",
      "body": "First Blood is a 1982 American action film directed by Ted Kotcheff and co-written by and starring Sylvester Stallone as Vietnam War veteran John Rambo. It co-stars Richard Crenna as Rambo's mentor Sam Trautman and Brian Dennehy as Sheriff Will Teasle. It is the first installment in the Rambo franchise, followed by Rambo: First Blood Part II.",
      "author": "John Rambo",
      "id": "1"
    },
    {
      "title": "Second Blood",
      "body": "Rambo: First Blood Part II is a 1985 American action film directed by George P. Cosmatos from a story by Kevin Jarre, and a screenplay by James Cameron and Sylvester Stallone, who also reprises his role as Vietnam War veteran John Rambo. A sequel to First Blood (1982), it is the second installment in the Rambo franchise, followed by Rambo III. It co-stars Richard Crenna, who reprises his role as Colonel Sam Trautman, along with Charles Napier, Julia Nickson, and Steven Berkoff.The film's plot is inspired by the Vietnam War POW/MIA issue. In the movie, Rambo gets released from prison in a deal with the United States government to document the possible existence of missing POWs in Vietnam, but is given strict orders not to rescue any. When Rambo defies his orders, he is abandoned and forced once again to rely on his own brutal combat skills to save the POWs.",
      "author": "John Rambo",
      "id": "2"
    },
    {
      "id": "16ab",
      "title": "The Fresh Prince of Bel-Air",
      "body": "The Fresh Prince of Bel-Air is an American television sitcom created by Andy and Susan Borowitz that aired on NBC from September 10, 1990, to May 20, 1996. The series stars Will Smith as a fictionalized version of himself, a street-smart teenager born and raised in West Philadelphia who is sent to live with his wealthy uncle and aunt in Bel-Air, Los Angeles, where his lifestyle often clashes with that of his upper-class relatives.",
      "actor": "Will Smith"
    },
    {
      "id": "b5c9",
      "title": "Terminator 2",
      "body": "Plot. In 2029, Earth has been ravaged by the war between the malevolent artificial intelligence Skynet and the human resistance. Skynet sends the T-1000—an advanced, shape-shifting prototype Terminator made of virtually indestructible liquid metal—back in time to kill resistance leader John Connor when he is a child.",
      "author": "Arnold"
    }
  ]
}